[Timeout] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:25:9
         ArchitectureRequest request,
         CancellationToken cancellationToken = default)
     {
-        ArgumentNullException.ThrowIfNull(request);
+        ;
 
         CoordinationResult output = new();

[Killed] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:30:13
         CoordinationResult output = new();
 
         List<string> validationErrors = ValidateRequest(request);
-        if (validationErrors.Count > 0)
+        if (!(validationErrors.Count > 0))
         {
             output.Errors.AddRange(validationErrors);
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Timeout] Equality mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:30:13
         CoordinationResult output = new();
 
         List<string> validationErrors = ValidateRequest(request);
-        if (validationErrors.Count > 0)
+        if (validationErrors.Count >= 0)
         {
             output.Errors.AddRange(validationErrors);

[NoCoverage] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:32:13
         List<string> validationErrors = ValidateRequest(request);
         if (validationErrors.Count > 0)
         {
-            output.Errors.AddRange(validationErrors);
+            ;
 
             if (logger.IsEnabled(LogLevel.Warning))

[NoCoverage] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:34:17
         {
             output.Errors.AddRange(validationErrors);
 
-            if (logger.IsEnabled(LogLevel.Warning))
+            if (!(logger.IsEnabled(LogLevel.Warning)))
             {
                 logger.LogWarning(

[NoCoverage] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:36:17
 
             if (logger.IsEnabled(LogLevel.Warning))
             {
-                logger.LogWarning(
-                    "Coordination rejected (validation): RequestId={RequestId}, SystemName={SystemName}, Errors={Errors}",
-                    request.RequestId,
-                    request.SystemName,
-                    string.Join("; ", validationErrors));
+                ;
             }
 

[NoCoverage] String mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:37:21
             if (logger.IsEnabled(LogLevel.Warning))
             {
                 logger.LogWarning(
-                    "Coordination rejected (validation): RequestId={RequestId}, SystemName={SystemName}, Errors={Errors}",
+                    "",
                     request.RequestId,
                     request.SystemName,

[Killed] Equality mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:53:25
             cancellationToken,
             evidenceBundle.EvidenceBundleId);
 
-        bool deferred = authorityRun.ContextSnapshotId is null;
+        bool deferred = authorityRun.ContextSnapshotId is not null;
 
         string runId = authorityRun.RunId.ToString("N");
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Killed] String mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:55:52
 
         bool deferred = authorityRun.ContextSnapshotId is null;
 
-        string runId = authorityRun.RunId.ToString("N");
+        string runId = authorityRun.RunId.ToString("");
         ArchitectureRun run = BuildRunFromAuthority(authorityRun, request, deferred);
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync

[Killed] Conditional (true) mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:58:33
         string runId = authorityRun.RunId.ToString("N");
         ArchitectureRun run = BuildRunFromAuthority(authorityRun, request, deferred);
 
-        List<AgentTask> tasks = deferred
-            ? []
-            : RunStarterTaskFactory.BuildStarterTasks(runId, evidenceBundle, request);
+        List<AgentTask> tasks = (true?[]
+:RunStarterTaskFactory.BuildStarterTasks(runId, evidenceBundle, request));
 
         run.TaskIds = [.. tasks.Select(t => t.TaskId)];
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Timeout] Conditional (false) mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:58:33
         string runId = authorityRun.RunId.ToString("N");
         ArchitectureRun run = BuildRunFromAuthority(authorityRun, request, deferred);
 
-        List<AgentTask> tasks = deferred
-            ? []
-            : RunStarterTaskFactory.BuildStarterTasks(runId, evidenceBundle, request);
+        List<AgentTask> tasks = (false?[]
+:RunStarterTaskFactory.BuildStarterTasks(runId, evidenceBundle, request));
 
         run.TaskIds = [.. tasks.Select(t => t.TaskId)];

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:68:13
         output.EvidenceBundle = evidenceBundle;
         output.Tasks = tasks;
 
-        if (logger.IsEnabled(LogLevel.Information))
+        if (!(logger.IsEnabled(LogLevel.Information)))
         {
             logger.LogInformation(

[Timeout] Block removal mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:69:9
         output.Tasks = tasks;
 
         if (logger.IsEnabled(LogLevel.Information))
-        {
-            logger.LogInformation(
-                "Coordination completed: RunId={RunId}, RequestId={RequestId}, StarterTaskCount={TaskCount}, EvidenceBundleId={EvidenceBundleId}, Deferred={Deferred}",
-                run.RunId,
-                request.RequestId,
-                tasks.Count,
-                evidenceBundle.EvidenceBundleId,
-                deferred);
-        }
+        {}
 
         return output;

[Killed] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:86:13
     {
         List<string> errors = [];
 
-        if (string.IsNullOrWhiteSpace(request.RequestId))
+        if (!(string.IsNullOrWhiteSpace(request.RequestId)))
             errors.Add("RequestId is required.");
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Killed] String mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:86:13
     {
         List<string> errors = [];
 
-        if (string.IsNullOrWhiteSpace(request.RequestId))
+        if ((request.RequestId!=""))
             errors.Add("RequestId is required.");
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[NoCoverage] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:87:13
         List<string> errors = [];
 
         if (string.IsNullOrWhiteSpace(request.RequestId))
-            errors.Add("RequestId is required.");
+            ;
 
         if (string.IsNullOrWhiteSpace(request.SystemName))

[Killed] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:89:13
         if (string.IsNullOrWhiteSpace(request.RequestId))
             errors.Add("RequestId is required.");
 
-        if (string.IsNullOrWhiteSpace(request.SystemName))
+        if (!(string.IsNullOrWhiteSpace(request.SystemName)))
             errors.Add("SystemName is required.");
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[NoCoverage] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:90:13
             errors.Add("RequestId is required.");
 
         if (string.IsNullOrWhiteSpace(request.SystemName))
-            errors.Add("SystemName is required.");
+            ;
 
         if (string.IsNullOrWhiteSpace(request.Description))

[Killed] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:92:13
         if (string.IsNullOrWhiteSpace(request.SystemName))
             errors.Add("SystemName is required.");
 
-        if (string.IsNullOrWhiteSpace(request.Description))
+        if (!(string.IsNullOrWhiteSpace(request.Description)))
             errors.Add("Description is required.");
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[NoCoverage] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:93:13
             errors.Add("SystemName is required.");
 
         if (string.IsNullOrWhiteSpace(request.Description))
-            errors.Add("Description is required.");
+            ;
 
         return errors;

[Killed] Conditional (true) mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:104:22
         {
             RunId = authorityRun.RunId.ToString("N"),
             RequestId = request.RequestId,
-            Status = deferred ? ArchitectureRunStatus.Created : ArchitectureRunStatus.TasksGenerated,
+            Status = (true?ArchitectureRunStatus.Created :ArchitectureRunStatus.TasksGenerated),
             CreatedUtc = DateTime.UtcNow,
             CompletedUtc = null,
killedBy: ArchLucid.Api.Tests.ArchitectureTests.GoldenPath_ShouldProduceManifest

[Timeout] Conditional (false) mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:104:22
         {
             RunId = authorityRun.RunId.ToString("N"),
             RequestId = request.RequestId,
-            Status = deferred ? ArchitectureRunStatus.Created : ArchitectureRunStatus.TasksGenerated,
+            Status = (false?ArchitectureRunStatus.Created :ArchitectureRunStatus.TasksGenerated),
             CreatedUtc = DateTime.UtcNow,
             CompletedUtc = null,

[Survived] String mutation
ArchiForge/ArchLucid.Coordinator/Services/CoordinatorService.cs:108:74
             CreatedUtc = DateTime.UtcNow,
             CompletedUtc = null,
             CurrentManifestVersion = null,
-            ContextSnapshotId = authorityRun.ContextSnapshotId?.ToString("N"),
+            ContextSnapshotId = authorityRun.ContextSnapshotId?.ToString(""),
             GraphSnapshotId = authorityRun.GraphSnapshotId,
             FindingsSnapshotId = authorityRun.FindingsSnapshotId,
