[Timeout] LogicalNotExpression to un-LogicalNotExpression mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:45:13
             ["cloudProvider"] = request.CloudProvider.ToString()
         };
 
-        if (!string.IsNullOrWhiteSpace(request.PriorManifestVersion))
+        if (string.IsNullOrWhiteSpace(request.PriorManifestVersion))
             metadata["priorManifestVersion"] = request.PriorManifestVersion;
 

[Killed] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:45:14
             ["cloudProvider"] = request.CloudProvider.ToString()
         };
 
-        if (!string.IsNullOrWhiteSpace(request.PriorManifestVersion))
+        if (!(request.PriorManifestVersion.Trim()!=""))
             metadata["priorManifestVersion"] = request.PriorManifestVersion;
 
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:50:56
 
         return new EvidenceBundle
         {
-            EvidenceBundleId = Guid.NewGuid().ToString("N"),
+            EvidenceBundleId = Guid.NewGuid().ToString(""),
             RequestDescription = request.Description,
             PolicyRefs = BuildPolicyRefs(request),

[Timeout] Conditional (true) mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:54:33
             RequestDescription = request.Description,
             PolicyRefs = BuildPolicyRefs(request),
             ServiceCatalogRefs = BuildServiceCatalogRefs(request),
-            PriorManifestRefs = string.IsNullOrWhiteSpace(request.PriorManifestVersion)
-                ? []
-                : [request.PriorManifestVersion],
+            PriorManifestRefs = (true?[]
+:[request.PriorManifestVersion]),
             Metadata = metadata
         };

[Timeout] Conditional (false) mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:54:33
             RequestDescription = request.Description,
             PolicyRefs = BuildPolicyRefs(request),
             ServiceCatalogRefs = BuildServiceCatalogRefs(request),
-            PriorManifestRefs = string.IsNullOrWhiteSpace(request.PriorManifestVersion)
-                ? []
-                : [request.PriorManifestVersion],
+            PriorManifestRefs = (false?[]
+:[request.PriorManifestVersion]),
             Metadata = metadata
         };

[Killed] Block removal mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:63:5
 
     /// <summary>Creates topology, cost, compliance, and critic starter tasks for the run.</summary>
     public static List<AgentTask> BuildStarterTasks(string runId, EvidenceBundle evidenceBundle, ArchitectureRequest request)
-    {
-        return
-        [
-            CreateTopologyTask(runId, evidenceBundle, request),
-            CreateCostTask(runId, evidenceBundle, request),
-            CreateComplianceTask(runId, evidenceBundle, request),
-            CreateCriticTask(runId, evidenceBundle, request)
-        ];
-    }
+    {}
 
     private static List<string> BuildPolicyRefs(ArchitectureRequest request)
killedBy: ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_AndDecisionEngine_ShouldProduceManifestAsync; ArchLucid.Coordinator.Tests.DeterministicAgentSimulatorTests.Simulator_ShouldProduceDeterministicStarterResultsAsync; ArchLucid.Coordinator.Tests.CoordinatorServiceTests.CreateRun_Should_CreateRunAndStarterTasks_When_RequestIsValid

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:81:13
             PolicyPackAzureSecurityBaseline
         ];
 
-        if (RequestConstraintClassifier.HasPrivateNetworkingConstraint(request))
+        if (!(RequestConstraintClassifier.HasPrivateNetworkingConstraint(request)))
             refs.Add(PolicyPrivateNetworkingRequired);
 

[Survived] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:82:13
         ];
 
         if (RequestConstraintClassifier.HasPrivateNetworkingConstraint(request))
-            refs.Add(PolicyPrivateNetworkingRequired);
+            ;
 
         if (RequestConstraintClassifier.HasManagedIdentityConstraint(request))

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:84:13
         if (RequestConstraintClassifier.HasPrivateNetworkingConstraint(request))
             refs.Add(PolicyPrivateNetworkingRequired);
 
-        if (RequestConstraintClassifier.HasManagedIdentityConstraint(request))
+        if (!(RequestConstraintClassifier.HasManagedIdentityConstraint(request)))
             refs.Add(PolicyManagedIdentityRequired);
 

[Survived] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:85:13
             refs.Add(PolicyPrivateNetworkingRequired);
 
         if (RequestConstraintClassifier.HasManagedIdentityConstraint(request))
-            refs.Add(PolicyManagedIdentityRequired);
+            ;
 
         if (RequestConstraintClassifier.HasEncryptionConstraint(request))

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:87:13
         if (RequestConstraintClassifier.HasManagedIdentityConstraint(request))
             refs.Add(PolicyManagedIdentityRequired);
 
-        if (RequestConstraintClassifier.HasEncryptionConstraint(request))
+        if (!(RequestConstraintClassifier.HasEncryptionConstraint(request)))
             refs.Add(PolicyEncryptionAtRestRequired);
 

[Survived] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:88:13
             refs.Add(PolicyManagedIdentityRequired);
 
         if (RequestConstraintClassifier.HasEncryptionConstraint(request))
-            refs.Add(PolicyEncryptionAtRestRequired);
+            ;
 
         return refs.Distinct(StringComparer.OrdinalIgnoreCase).ToList();

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:101:13
             CatalogAzureSql
         ];
 
-        if (RequestConstraintClassifier.RequiresSearchCapability(request))
+        if (!(RequestConstraintClassifier.RequiresSearchCapability(request)))
             refs.Add(CatalogAzureAiSearch);
 

[Timeout] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:102:13
         ];
 
         if (RequestConstraintClassifier.RequiresSearchCapability(request))
-            refs.Add(CatalogAzureAiSearch);
+            ;
 
         if (RequestConstraintClassifier.RequiresAiCapability(request))

[Timeout] Negate expression
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:104:13
         if (RequestConstraintClassifier.RequiresSearchCapability(request))
             refs.Add(CatalogAzureAiSearch);
 
-        if (RequestConstraintClassifier.RequiresAiCapability(request))
+        if (!(RequestConstraintClassifier.RequiresAiCapability(request)))
             refs.Add(CatalogAzureAiServices);
 

[Timeout] Statement mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:105:13
             refs.Add(CatalogAzureAiSearch);
 
         if (RequestConstraintClassifier.RequiresAiCapability(request))
-            refs.Add(CatalogAzureAiServices);
+            ;
 
         return refs.Distinct(StringComparer.OrdinalIgnoreCase).ToList();

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:114:46
     {
         return new AgentTask
         {
-            TaskId = Guid.NewGuid().ToString("N"),
+            TaskId = Guid.NewGuid().ToString(""),
             RunId = runId,
             AgentType = AgentType.Topology,

[Survived] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:191:29
             CreatedUtc = DateTime.UtcNow,
             CompletedUtc = null,
             EvidenceBundleRef = evidenceBundle.EvidenceBundleId,
-            AllowedTools = ["architecture-review-checklist", ToolPolicyPackReader],
+            AllowedTools = ["", ToolPolicyPackReader],
             AllowedSources =
             [

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:206:13
     {
         return
             $"Design an initial Azure topology for system '{request.SystemName}' " +
-            $"in environment '{request.Environment}'. " +
+            $"" +
             $"Description: {request.Description}";
     }

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:207:13
         return
             $"Design an initial Azure topology for system '{request.SystemName}' " +
             $"in environment '{request.Environment}'. " +
-            $"Description: {request.Description}";
+            $"";
     }
 

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:214:51
     {
         return
             $"Estimate cost posture and cost-sensitive design considerations for system '{request.SystemName}'. " +
-            $"Required capabilities: {string.Join(", ", request.RequiredCapabilities)}";
+            $"Required capabilities: {string.Join("", request.RequiredCapabilities)}";
     }
 

[Timeout] String mutation
ArchiForge/ArchLucid.Coordinator/Services/RunStarterTaskFactory.cs:229:13
         return
             $"Critique the implied architecture for system '{request.SystemName}' " +
             $"and identify omissions, contradictions, or weak assumptions " +
-            $"that may undermine enterprise readiness or governance.";
+            $"";
     }
 }
